[
  {
    "page": 1,
    "text": "THE COMPANY PROFILE\nDMAC ZIMBABWE\nPvt Ltd\n+263776937172\n+263778598381\ndmaczimbabwe\n@gmail.com\nwww.dmaczimbabwe.com\n40 James Martin\ndrive, Lochinvar,\nHarare"
  },
  {
    "page": 2,
    "text": "DMAC\nZImbabwe\nPvt Ltd\nSustainability\nstatement \nSustainability is the foundation of all DMAC' s\nplanning and corporate actions. We believe\nstrongly that our business has an inseparable\nsymbiotic relationship with our environment\nand our community.  Guided by this\nphilosophy,  we have been very relevant to\nour communities and have played pivotal roles\nin preserving and upgrading our environment. \nAs an organisation,  we have very strong\ndefined targets on both our environment and\ncommunity.  Doing business with us is helping\nour communities and our environment. \nwww.dmaczimbabwe.com"
  },
  {
    "page": 3,
    "text": "Strategic\nFoundations \nVISION\n\"To become a leader in offering\nsustainable unique total\nhospitality service to our clients \"\nCORE VALUES\n1. Excellence\n2. Innovation\n3. Integrity\n4. Teamwork\nwww.dmaczimbabwe.com\nDMAC\nZImbabwe\nPvt Ltd"
  },
  {
    "page": 4,
    "text": "About Company\nDMAC Zimbabwe is a subsidiary of DMAC Dubai focusing mainly\nin the hospitality and mining sectors of Zimbabwe. In Dubai, DMAC\nplaced itself as a bridge of the movement of capital and technology\nfrom the developed world into Africa and the reverse movement of\nfinished products from Africa to the global markets. To this end\nDMAC,  Dubai has helped a number of African governments in\nraising needed finance and investments as well as bridging African\nproducts to the global markets.\nDMAC Lifestyle Centre is the hospitality flagship of DMAC\nZimbabwe Private limited with its main brach at number 40 James\nMartin drive,  Lochinvar,  Harare. In Harare, DMAC has 7 beautiful\nfunction halls of different capacities ranging from 50 people to\n1000 people seated on tables. \nDMAC is currently finishing its Mhondoro Conference Centre. In\nMalaysia,  DMAC has also started putting a big hospitality centre\ncovering accommodation,  restaurants and events.\nwww.dmaczimbabwe.com\nDMAC\nZImbabwe\nPvt Ltd"
  },
  {
    "page": 5,
    "text": "DMAC Lifestyle Centre is pushing to be the best in offering corporate\nfunctions in Zimbabwe.  With our global experience,  we shall help in\nensuring corporate functions in Zimbabwe are done in a environment\nand setup comparable to any other place in the world.\nOur setting up in global destinations like Malysia,  Dubai and Rwanda\nshall also help local  Zimbabwean employees have global experience\nthrough our interchange program.\nCEO MESSAGE\nVimbai\nChakanetsa \nDMAC Zimbabwe Private Limited is\nthe \nembodiment \nof \nsustainable\nbusiness \npractice \nin \nZimbabwe.\nWorking \nwith \nZNA \nnurses, \nthe\norganisation played a key role during\nCovid \npandemic \noffering \nfree\nvaccination to all southern suburbs\nand industries in Harare. Our actions\nare guided by our philosophy of\n'living today for tomorrow '. Tourism\nis one sector that can be used as an\nagent for economic development and  \ntransformation \n \nbecause \nof \nits\nlinkages to many sectors. As DMAC\nwe shall endeavour to tap the vast\nuntapped tourism potential in a\nsustainable way, minimising negative\nsocial, cultural and environmental\nimpacts. \nwww.dmaczimbabwe.com\nDMAC\nZImbabwe\nPvt Ltd"
  },
  {
    "page": 6,
    "text": "DMAC Lifestyle Centre has 7 function halls with capacities ranging\nfrom 50 to 1000 guests seated on tables. On a cinema setup,  our\nmaximum hall capacity is about 2000 guests. We have state of the\nart conference equipment and accessories which meets global\nstandards \nDMAC offers second to none conferencing facilities as well as team\nbuilding activities to all corporates. We also have accommodation\nand a restaurant that gives variety of food offerings. \nCorporate\nFunctions \nwww.dmaczimbabwe.com\nDMAC\nZImbabwe\nPvt Ltd"
  },
  {
    "page": 7,
    "text": "Academic\nFunctions \nDMAC Lifestyle Centre offers a wide range of academic functions from\ngraduations,  prefect trainings, inductions, team building activities,  \nleavers parties and anything related to the field of academics"
  },
  {
    "page": 8,
    "text": "Social\nfunctions \nWe offer a range of social functions including weddings,  marooro\nfunctions,  picnics,  engagements,  birthday parties and any other social\ncelebrations. \nOur packages here ranges from silver, gold and platinum \nwww.dmaczimbabwe.com"
  },
  {
    "page": 9,
    "text": "MAjor CSR Projects\nThe future of any community is measured by the value they put on\neducation. One of DMAC's core CSR commitment is in children education.\nWe helped in sourcing primary and secondary school textbooks of\nMutimusakwa School in Mhondoro and since then there has been\nremarkable improvement in the school results. \nIgniting the Future Through Education\nA Commitment to Public Health.\nDuring the peak of the Covid health crisis, DMAC in conjunction with the\nZimbabwe National Army mobilized resources to ensure community\nsafety through free vaccinations. This image captures our rapid response\neffort, providing essential COVID-19 testing and health education\nthrough our mobile Lifestyle Centre. Our CSR vision means standing on\nthe front lines, actively supporting the resilience and well-being of the\npeople we serve. Health is not a privilege; it is our priority.\nwww.dmaczimbabwe.com\nDMAC\nZImbabwe\nPvt Ltd\nHonoring our Heroes\nBetween the period 2019 to 2021, human remains of our ex-freedom\nfighters were found in a disused shaft in the Odzi area of Mutare. Working\nwith all the different arms of government,  DMAC spearheaded the\nexhumation and reburial of 120 bodies of our ex freedom fighters. The\nwhole exercise was done at a cost of US$350,000 which was fully funded\nby DMAC Zimbabwe Pvt Limited."
  },
  {
    "page": 10,
    "text": "Let's Work Together\n+263776937172/+\n263778598381\ndmaczimbabwe@\ngmail.com\nwww.dmaczimbabwe.com\nOur future as an organisation is dependant on the continual growth\nand economic success of all our clients.  As DMAC,  we put a\npremium on all the events entrusted to us by our clients as their\nsuccess in business is also our success.\nWith our serious value we place on the issues of sustainability,  \nevery cent you put to DMAC as a client is a serious investment in\nour future through our commitment to children education and the\nenvironment \nDMAC\nZImbabwe\nPvt Ltd"
  }
]